In [1]:
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
data=pd.read_excel("C:\\Users\\uidn8348\\Documents\\learnmall\\Data Pre-Processing\\Data Pre-Processing.xlsx")

In [3]:
data.head()

        City  Age    Salary Bought
0     Mumbai  55.0  82657.0     No
1  Bangalore  38.0  58657.0    Yes
2      Delhi  41.0  64657.0     No
3  Bangalore  49.0  71657.0     No
4      Delhi  51.0      NaN    Yes

In [4]:
data.isnull().sum()

City      0
Age       1
Salary    1
Bought    0
dtype: int64

In [5]:
x = data.iloc[:,:-1]
y = data.iloc[:,-1]

In [6]:
x

        City  Age    Salary
0     Mumbai  55.0  82657.0
1  Bangalore  38.0  58657.0
2      Delhi  41.0  64657.0
3  Bangalore  49.0  71657.0
4      Delhi  51.0      NaN
5     Mumbai  46.0  68657.0
6  Bangalore   NaN  62657.0
7     Mumbai  59.0  89657.0
8      Delhi  61.0  93657.0
9     Mumbai  48.0  77657.0

In [7]:
y

0     No
1    Yes
2     No
3     No
4    Yes
5    Yes
6     No
7    Yes
8     No
9    Yes
Name: Bought, dtype: object

In [8]:
from sklearn.impute import SimpleImputer
imputer = SimpleImputer(missing_values = np.nan, strategy = 'median',verbose=0)
imputer = imputer.fit(x.iloc[:, 1:3])
x.iloc[:, 1:3] = imputer.transform(x.iloc[:, 1:3])

In [10]:
x.isnull().sum()

City      0
Age       0
Salary    0
dtype: int64

In [11]:
from sklearn.preprocessing import LabelEncoder, OneHotEncoder
from sklearn.compose import ColumnTransformer

en_X= LabelEncoder()
x.iloc[:,0] = en_X.fit_transform(x.iloc[:,0])

en_Y= LabelEncoder()
y = en_Y.fit_transform(y)

ct = ColumnTransformer([("Bought", OneHotEncoder(), [1])], remainder = 'passthrough')
x = ct.fit_transform(x)

In [13]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x,y,test_size= 0.2,random_state = 65)